[
    {
        "name": "Retro Game Hub Website",
        "category": "Website",
        "description": "For my final project in the WDD231 Frontend Development course at BYU-Idaho, I had the privilege of designing and developing this website. Throughout the course, I gained valuable knowledge and hands-on experience in building dynamic and interactive web content using JavaScript. This project allowed me to apply the principles I learned, such as manipulating the Document Object Model (DOM), enhancing user interactivity, and implementing best practices in responsive web design. The experience significantly improved my understanding of frontend development and deepened my appreciation for the power of JavaScript in creating engaging, user-friendly websites.",
        "image": "./images/retro-game-hub.png",
        "link": "https://dammybot.github.io/wdd231/project/index.html"
    },
    {
        "name": "Bountiful Foods Website",
        "category": "Website",
        "description": "For my final project in the WDD230 Frontend Development course at Brigham Young University-Idaho, I had the privilege of applying the knowledge and skills I acquired throughout the course to build this website. This project allowed me to demonstrate my understanding of fundamental web development principles, including the creation of dynamic and interactive web content. Throughout the course, I gained valuable experience working with HTML, CSS, and JavaScript to build responsive, user-friendly interfaces. I learned how to use JavaScript to add interactivity, enabling websites to respond to user actions and deliver a more engaging experience. This project serves as a testament to my growth and dedication to mastering frontend development, as well as my ability to implement industry best practices to create functional and visually appealing web applications.",
        "image": "./images/bountiful-foods.png",
        "link": "https://dammybot.github.io/wdd230/project/project/index.html"
    },
    {
        "name": "Task Manager",
        "category": "Website",
        "description": "This Task Manager is a simple web-based application that allows users to add, complete, and delete tasks while ensuring data persistence using localStorage. Users can enter a task into an input field, add it to the list, and mark it as completed using a checkbox, which moves it to a separate completed section. Tasks remain stored even after refreshing the page, as every addition, completion, or deletion dynamically updates localStorage. Built using HTML, CSS (optional for styling), and JavaScript, this project demonstrates event handling and data persistence techniques.",
        "image": "./images/to-do-list.png",
        "link": "https://dammybot.github.io/web-projects/todo/index.html"
    },
    {
        "name": "A day in the life Video",
        "category": "Video",
        "description": "Edited a compelling documentary-style YouTube video exploring the realities of surviving on minimum wage in Portugal. This project involved: Storytelling Through Editing, Dynamic Visuals & Motion Graphics, Sound Design & Mixing, Seamless Cuts & Transitions which ensured smooth pacing while maintaining authenticity. A paid project that challenged me to blend storytelling with technical precision to deliver an insightful and engaging watch.",
        "image": "./images/tommy.gif",
        "link": "https://drive.google.com/file/d/1yQUJHzShPZyLLfR70bHQ6PkEd9LfDbfq/view?usp=sharing"
    },
    {
        "name": "Street Interview Video",
        "category": "Video",
        "description": "For a paid project, I had the opportunity to professionally edit a dynamic street interview video. This project allowed me to refine my skills in video pacing, smooth transitions, and storytelling through post-production. I focused on enhancing the flow of conversations, ensuring crisp cuts, and polishing the audio-visual experience to maintain viewer engagement. Working on this edit reinforced my ability to create compelling and high-quality content that aligns with a client's vision while maintaining professional standards.",
        "image": "./images/miller.gif",
        "link": "https://drive.google.com/file/d/1yQUJHzShPZyLLfR70bHQ6PkEd9LfDbfq/view?usp=sharing"
    },
    {
        "name": "Short youtube AD",
        "category": "Video",
        "description": "Crafted a dynamic and engaging short YouTube ad for a growing content creator, designed to boost visibility and attract new subscribers. This project involved precise editing, strategic pacing, and attention-grabbing visuals to ensure maximum impact. A great opportunity to apply my skills in video editing, motion graphics, and storytelling while delivering a polished final product for a paid client.",
        "image": "./images/yt.gif",
        "link": "https://drive.google.com/file/d/1KNgSr03ZsoPBdOBDT4pbvIez28Zm9W_b/view?usp=sharing"
    },
    {
        "name": "CODM torunament thriller",
        "category": "Video",
        "description": "Edited a high-intensity Call of Duty Mobile Tournament Thriller for African Championship Leauge. This paid project involved dynamic motion graphics, precise sync to music and SFX, seamless transitions, and high-impact visuals to capture the energy of competitive gameplay. Focused on maintaining pacing, engaging storytelling, and an adrenaline-pumping atmosphere. A thrilling challenge—and an even more rewarding final product! ",
        "image": "./images/apc.gif",
        "link": "https://drive.google.com/file/d/1CTGzgUAcyjN-Kkxo8dyUkGxFmmMq7J8y/view?usp=drive_link"
    },
    {
        "name": "CODM tournament ad",
        "category": "Video",
        "description": "Commissioned to edit an action-packed Call of Duty Mobile Tournament Thriller. 🎬⚡ Focused on high-impact motion graphics, seamless transitions, and intense sound design to capture the adrenaline of competitive play. Every cut, effect, and beat was crafted to build anticipation and hype for the event. A rewarding project that pushed my creative and technical skills!",
        "image": "./images/apc1.gif",
        "link": "https://drive.google.com/file/d/1YAW8lASHPwyCsehwB6v2exIq2CPoUvpx/view?usp=drive_link"
    },
    {
        "name": "Muhichiro AMV",
        "category": "Video",
        "description": "A short anime edit I made when I got bored, more like a collaboration video I made with a friend",
        "image": "./images/collab_TBK.gif",
        "link": "https://www.instagram.com/p/C7mDRXAtrVr/"
    },
    {
        "name": "Horimiya AMV",
        "category": "Video",
        "description": "A short anime edit I made during valentines",
        "image": "./images/horimiya.gif",
        "link": "https://www.instagram.com/p/CrXyPzBANVD/"
    },
    {
        "name": "Zoro AMV",
        "category": "Video",
        "description": "A short anime edit I made practicing how flows work in video editing",
        "image": "./images/zoro.gif",
        "link": "https://www.instagram.com/p/CqGUE2ngaAM/"
    },
    {
        "name": "CODM edit",
        "category": "Video",
        "description": "Short commision CODM montage for a youtuber",
        "image": "./images/codm.gif",
        "link": "https://www.instagram.com/p/DHEkgQ4snVL/"
    },
    {
        "name": "3D Donut render",
        "category": "Game",
        "description": "Short 3d render of a donut following Blender Guru tutorial",
        "image": "./images/donut.gif",
        "link": "https://www.instagram.com/p/CxrBZG_svPN/"
    },
    {
        "name": "Flappy Bird Remake",
        "category": "Game",
        "description": "Made a small Flappy Bird remake in UE4! Learned blueprints, keybinds, blueprint casting, sound design, and collision systems. Honestly, such a fun project if I do say so myself!",
        "image": "./images/flappy-bird.gif",
        "link": "https://www.instagram.com/p/DHRFwpKMKCM/"
    }
]