[
    {
        "name": "Retro Game Hub Website",
        "category": "Website",
        "description": "For my final project in the WDD231 Frontend Development course at BYU-Idaho, I had the privilege of designing and developing this website. Throughout the course, I gained valuable knowledge and hands-on experience in building dynamic and interactive web content using JavaScript. This project allowed me to apply the principles I learned, such as manipulating the Document Object Model (DOM), enhancing user interactivity, and implementing best practices in responsive web design. The experience significantly improved my understanding of frontend development and deepened my appreciation for the power of JavaScript in creating engaging, user-friendly websites.",
        "image": "./images/retro-game-hub.png",
        "link": "https://dammybot.github.io/wdd231/project/index.html"
    },
    {
        "name": "Bountiful Foods Website",
        "category": "Website",
        "description": "For my final project in the WDD230 Frontend Development course at Brigham Young University-Idaho, I had the privilege of applying the knowledge and skills I acquired throughout the course to build this website. This project allowed me to demonstrate my understanding of fundamental web development principles, including the creation of dynamic and interactive web content. Throughout the course, I gained valuable experience working with HTML, CSS, and JavaScript to build responsive, user-friendly interfaces. I learned how to use JavaScript to add interactivity, enabling websites to respond to user actions and deliver a more engaging experience. This project serves as a testament to my growth and dedication to mastering frontend development, as well as my ability to implement industry best practices to create functional and visually appealing web applications.",
        "image": "./images/bountiful-foods.png",
        "link": "https://dammybot.github.io/wdd230/project/project/index.html"
    },
    {
        "name": "Task Manager",
        "category": "Website",
        "description": "This Task Manager is a simple web-based application that allows users to add, complete, and delete tasks while ensuring data persistence using localStorage. Users can enter a task into an input field, add it to the list, and mark it as completed using a checkbox, which moves it to a separate completed section. Tasks remain stored even after refreshing the page, as every addition, completion, or deletion dynamically updates localStorage. Built using HTML, CSS (optional for styling), and JavaScript, this project demonstrates event handling and data persistence techniques.",
        "image": "./images/to-do-list.png",
        "link": "https://dammybot.github.io/web-projects/todo/index.html"
    },
    {
        "name": "Muhichiro AMV",
        "category": "Video",
        "description": "A short anime edit I made when I got bored, more like a collaboration video I made with a friend",
        "image": "./images/collab_TBK.gif",
        "link": "https://www.instagram.com/p/C7mDRXAtrVr/"
    },
    {
        "name": "Horimiya AMV",
        "category": "Video",
        "description": "A short anime edit I made during valentines",
        "image": "./images/horimiya.gif",
        "link": "https://www.instagram.com/p/CrXyPzBANVD/"
    },
    {
        "name": "Zoro AMV",
        "category": "Video",
        "description": "A short anime edit I made practicing how flows work in video editing",
        "image": "./images/zoro.gif",
        "link": "https://www.instagram.com/p/CqGUE2ngaAM/"
    },
    {
        "name": "CODM edit",
        "category": "Video",
        "description": "Short commision CODM montage for a youtuber",
        "image": "./images/codm.gif",
        "link": "https://www.instagram.com/p/DHEkgQ4snVL/"
    },
    {
        "name": "3d Donut render",
        "category": "Game",
        "description": "Short 3d render of a donut following Blender Guru tutorial",
        "image": "./images/donut.gif",
        "link": "https://www.instagram.com/p/CxrBZG_svPN/"
    }
]